mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/s6e2c3xh.svd
        <!-- REGISTER "PDIRB" -->
        <register>
          <name>PDIRB</name>
          <description>Port Input Data Register B [BHW]</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PDIRC" -->
        <register>
          <name>PDIRC</name>
          <description>Port Input Data Register C [BHW]</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PDIRC</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PDIRC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PDIRC</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PDIRC</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PDIRC</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PDIRC</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PDIRC</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of PDIRC</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDIRC</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDIRC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDIRC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDIRC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDIRC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDIRC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDIRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDIRC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIRD" -->
        <register>
          <name>PDIRD</name>
          <description>Port Input Data Register D [BHW]</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDIRD</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDIRD</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDIRD</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
